## Plan Result (sbox_global)




<pre><code>Plan: 7 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;netbox-sandbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_D[&#34;netbox-sandbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin_redirect[&#34;netbox-sandbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group_redirect[&#34;netbox-sandbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_D[&#34;netbox-sandbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule.redirect_hostname[&#34;netbox-sandbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule_set.redirect_hostname_rule_set[&#34;netbox-sandbox&#34;]
* Update
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain["netbox-sandbox"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + expiration_date          = (known after apply)
      + host_name                = "netbox.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "netbox-sandbox"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_D["netbox-sandbox"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_D" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin_redirect["netbox-sandbox"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin_redirect" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "netbox.sandbox.platform.hmcts.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "netbox-sandbox"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group_redirect["netbox-sandbox"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group_redirect" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                                                        = (known after apply)
      + name                                                      = "netbox-sandbox"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_D["netbox-sandbox"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_D" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + cdn_frontdoor_rule_set_ids      = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "netbox-sandboxredirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_rule.redirect_hostname["netbox-sandbox"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "redirect_hostname" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "netboxsandboxredirectrule"
      + order                       = 1

      + actions {
          + url_redirect_action {
              + destination_hostname = "netbox-sandbox.hmcts.net"
              + redirect_protocol    = "Https"
              + redirect_type        = "Moved"
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_rule_set.redirect_hostname_rule_set["netbox-sandbox"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "redirect_hostname_rule_set" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                       = (known after apply)
      + name                     = "netboxsandboxredirectruleset"
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1857,"Program":"tfcmt","SHA1":"","Target":"sbox_global","Vars":{}} -->